app/controllers/short_urls_controller.rb

  def create
    ShortUrl.create(long_url: params[:url])
---
INSERT INTO "short_urls" ("long_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "https://www.google.com"], ["created_at", "2023-03-27 13:40:22.318172"], ["updated_at", "2023-03-27 13:40:22.318172"]]

  def show
    @short_url.increment!(:access_count)
---
UPDATE "short_urls" SET "access_count" = COALESCE("access_count", 0) + $1 WHERE "short_urls"."id" = $2  [["access_count", 1], ["id", 1]]

  def set_short_url
    @short_url = ShortUrl.find_by(short_code: params[:id])
---
SELECT "short_urls".* FROM "short_urls" WHERE "short_urls"."short_code" = $1 LIMIT $2  [["short_code", "b"], ["LIMIT", 1]]